[{
    "image": "https://media.deseretdigital.com/file/7fefa66649",
    "bio": "Richard K. Ahadjie, 63, Adenta, Ghana; managing director, Rema-Alma Co. Ltd.; currently serving as a sealer in the Accra Ghana Temple; former bishop, branch president, high councilor, mission president and stake president; wife, Emelia; six children."
}, {
    "image": "https://media.deseretdigital.com/file/6131517431",
    "bio": "Alberto A. Álvarez, 57, Lecheria, Venezuela; currently serving as president of the Venezuela Barcelona Mission; former bishop, district presidency member, mission presidency member, stake presidency member and stake president; wife: Aurora; three children."
}, {
    "image": "",
    "bio": "Duane D. Bell, 46, East London, South Africa; sales representative, Space Television; currently serving as institute teacher; former bishop, bishopric member, branch presidency member, district mission president and stake president; wife, Jocelyn; four children."
}, {
    "image": "https://media.deseretdigital.com/file/78864a8159",
    "bio": "Glenn Burgess, 53, Glen Eden, New Zealand; police officer, New Zealand Police Service; currently serving as institute teacher; former bishop, bishopric member, high councilor and stake president; wife, Tracey Fay; three children."
}, {
    "image": "https://media.deseretdigital.com/file/ebb83c7361",
    "bio": "Víctor R. Calderón, 57, Medellin, Colombia; currently serving as president of the Colombia Medellin Mission; former bishop, branch president, high councilor and stake presidency member; wife, Patricia; two children."
}, {
    "image": "https://media.deseretdigital.com/file/03154d0216",
    "bio": "Ariel E. Chaparro, 50, Lomas de Zamora, Argentina; recently released as president of the Argentina Salta Mission; former bishop, mission presidency member, mission president and stake president; wife, Ana Scazzina; five children."
}, {
    "image": "https://media.deseretdigital.com/file/4975670985",
    "bio": "Daniel Córdova, 50, Monterrey, Mexico; coordinator, Seminaries and Institutes; currently serving as high priests group leader; former bishop, high councilor, mission president, stake presidency member and stake president; wife, Teresa; two children."
}, {
    "image": "https://media.deseretdigital.com/file/728a842357",
    "bio": "John N. Craig, 58, Calgary, Canada; currently serving as president of the Canada Winnipeg Mission; former bishop, high councilor and stake president; wife, Carol; seven children."
}, {
    "image": "https://media.deseretdigital.com/file/7b4b8d3832",
    "bio": "Michael Cziesla, 45, Griesheim, Germany; attorney (senior partner), McDermott Will & Emery; currently serving as president of the Frankfurt Germany Stake; former bishopric member, high councilor and stake president; wife, Margret Anne; five children."
}, {
    "image": "https://media.deseretdigital.com/file/b72d586275",
    "bio": "William H. Davis, 61, Latte Heights, Guam; real estate supervisor, Guam International Real Estate Office; currently serving as national director of Public Affairs for the Federated States of Micronesia National Public Affairs Council; former branch president, district president and mission presidency member; wife, Wanda; four children."
}, {
    "image": "https://media.deseretdigital.com/file/9fb1d04871",
    "bio": "Richard J. DeVries, 62, St Joseph, Michigan; regional president, Chemical Bank, South Region; currently serving as ward Sunday School president; former bishop, bishopric member, mission president, stake presidency member and stake president; wife, Dyana; six children."
}, {
    "image": "https://media.deseretdigital.com/file/7239b90117",
    "bio": "Kylar G. Dominguez, 48, Tlalnepantla, Mexico; insurance agent, GNP; currently serving as a Sunday School teacher; former bishop, branch president, stake presidency member and stake president; wife, Claudia; three children."
}, {
    "image": "https://media.deseretdigital.com/file/1f19695271",
    "bio": "Sean Douglas, 53, The Woodlands, Texas; executive vice president/chief financial officer, Huntsman Corporation; currently serving as stake missionary preparation teacher; former bishop, bishopric member and mission president; wife, Ann; four children."
}, {
    "image": "https://media.deseretdigital.com/file/a6c84e5271",
    "bio": "Michael A. Dunn, 60, Salt Lake City, Utah; general manager, BYU Broadcasting; recently released as president of the South Africa Johannesburg Mission; former bishop, bishopric member, high councilor, mission president and stake president; wife, Linda; three children."
}, {
    "image": "https://media.deseretdigital.com/file/c2ee305357",
    "bio": "Kenneth J. Firmage, 51, Star, Idaho; senior director of national accounts, PetIQ; currently serving as president of the Star Idaho Stake; former bishop and bishopric member; wife, Sonja; four children."
}, {
    "image": "https://media.deseretdigital.com/file/6ec4d89581",
    "bio": "Edgar Flores, 56, Puebla, Mexico; employment resource center manager, Puebla, Mexico; currently serving as Sunday School teacher; former bishop, high councilor, mission president, stake presidency member and stake president; wife, Gabriela; four children."
}, {
    "image": "https://media.deseretdigital.com/file/eb818f9568",
    "bio": "Silvio Flores, 56, Tampico, Mexico; executive, Tiendas Autoservicio; currently serving as president of the Tampico México Chairel Stake; former branch president and stake presidency member; wife, Sandra; three children."
}, {
    "image": "https://media.deseretdigital.com/file/7a494b2894",
    "bio": "Saulo G. Franco, 47, Navarrete, Spain; research director, Resins and Polymer Department, Barpimo S. A.; currently serving as president of the Vitoria Spain Stake; former branch president and high councilor; wife, Kátia Cristina; three children."
}, {
    "image": "https://media.deseretdigital.com/file/8a337c0522",
    "bio": "Carlos A. Genaro, 51, Sorocaba, Brazil; contractor, self-employed; currently serving as high councilor; former bishop, high councilor, mission president, stake presidency member and stake president; wife, Andréia Espelho; two children."
}, {
    "image": "https://media.deseretdigital.com/file/40c7651402",
    "bio": "Mark A. Gilmour, 42, Romsey, England; director, Portfolio Strategy - Mobile, Ciena Ltd; currently serving as a ward young single adult adviser; former bishopric member, high councilor and stake president; wife, Lisa Ann; four children."
}, {
    "image": "https://media.deseretdigital.com/file/aa42ad7564",
    "bio": "Sergio A. Gómez, 53, Buenos Aires, Argentina; temple recorder, Buenos Aires Argentina Temple; currently serving in the presidency of the Argentina Buenos Aires North Mission; former bishop, branch president, district presidency member, high councilor, mission president and stake presidency member; wife, Alejandra Maria; six children."
}, {
    "image": "https://media.deseretdigital.com/file/b199a14954",
    "bio": "Roberto Gonzalez, 48, Fraijanes, Guatemala; director, Funval - Fundet Latin America; currently serving as institute teacher; former branch president, high councilor, mission presidency member, stake presidency member and stake president; wife, Lilian; six children."
}, {
    "image": "https://media.deseretdigital.com/file/b09f633151",
    "bio": "Virgilio Gonzalez, 43, Tuxtla Gutierrez, Mexico; attorney; currently serving as president of the Tuxtla Gutiérrez México Mactumatzá Stake; former bishopric member and stake presidency member; wife, Cristina; three children."
}, {
    "image": "https://media.deseretdigital.com/file/797e1a5529",
    "bio": "Spencer R. Griffin, 63, Billings, Montana; owner, Auto Auction of Montana; currently serving as Sunday School teacher; former bishop, branch president, mission presidency member, mission president and stake president; wife, Jeannie; six children."
}, {
    "image": "https://media.deseretdigital.com/file/0f53fb5535",
    "bio": "Matthew S. Harding, 55, Raleigh, North Carolina; general counsel, Trail Creek Investments; currently serving as president of the Raleigh North Carolina Stake; former bishop, bishopric member, high councilor and stake mission president; wife, Reneé Dawn; two children."
}, {
    "image": "https://media.deseretdigital.com/file/89fb958732",
    "bio": "David J. Harris, 64, Siloam Springs, Arkansas; director, quality assurance, Simmon Foods, Inc.; currently serving as patriarch of the Springdale Arkansas Stake; former bishop, branch president, high councilor, stake presidency member and stake president; wife, Lisa; four children."
}, {
    "image": "https://media.deseretdigital.com/file/50080c2029",
    "bio": "Kevin J. Hathaway, 43, Idaho Falls, Idaho; CEO, Touchstone Medical Corporation; currently serving as president of the Idaho Falls North Stake; former bishop and bishopric member; wife, Kali; six children."
}, {
    "image": "https://media.deseretdigital.com/file/51d1312064",
    "bio": "Richard Holzapfel, 63, Salt Lake City, Utah; senior manager, Missionary Department; recently released as president of the Provo Utah YSA 1st Stake; former bishop, high councilor, mission president and stake president; wife, Jeni; five children."
}, {
    "image": "https://media.deseretdigital.com/file/e549817019",
    "bio": "Eustache Ilunga, 44, Kinshasa, Democratic Republic of Congo; service center manager, LDS Church; currently serving as president of the Kinshasa Democratic Republic of Congo Stake; wife, Mamie; four children."
}, {
    "image": "https://media.deseretdigital.com/file/a222fd6575",
    "bio": "Okechukwu I. Imo, 46, Tema, Ghana; area physical facilities manager, Africa West Area Physical Facilities Management Office; currently serving as stake temple and family history consultant; former bishop, bishopric member, high councilor, stake mission president and stake president; wife, Ogechi Adaku Mayjoy; four children."
}, {
    "image": "https://media.deseretdigital.com/file/7d2b587011",
    "bio": "Peter M. Johnson, 51, Tuscaloosa, Alabama; associate professor, University of Alabama; currently serving as president of the Bessemer Alabama Stake; former bishopric member; wife, Stephanie; four children."
}, {
    "image": "https://media.deseretdigital.com/file/7328082212",
    "bio": "Michael D. Jones, 53, Arvada, Colorado; owner/chairman of board, Sonsio Inc.; currently serving as Public Affairs director; former bishop, bishopric member, high councilor and stake president; wife, Kay; eight children."
}, {
    "image": "https://media.deseretdigital.com/file/d55fd16128",
    "bio": "Pungwe S. Kongolo, 53, Lubumbashi, Democratic Republic of Congo; assistant director, General Hospital/Ministry of Health; currently serving as a high councilor; former bishop and stake president; wife, Séraphine; two children."
}, {
    "image": "https://media.deseretdigital.com/file/488dc59161",
    "bio": "George Kenneth G. Lee, 45, Pasig City, Philippines; area welfare assistant manager, Philippines Area; currently serving as high priests group leader; former mission presidency member and stake presidency member; wife, Angelica; three children."
}, {
    "image": "https://media.deseretdigital.com/file/e327470535",
    "bio": "Aretemio C. Maligon, 54, San Pablo City, Philippines; area physical facilities manager, Church Physical Facilities Department; currently serving as president of the San Pablo Philippines Stake; former bishop, high councilor and stake presidency member; wife, Arlene; four children."
}, {
    "image": "https://media.deseretdigital.com/file/5605b29188",
    "bio": "Edgar A. Mantilla, 58, Medellin, Colombia; regional coordinator, CES; currently serving as Sunday School president; former bishop, bishopric member, branch president, high councilor, mission president and stake president; wife: Claudia; four children."
}, {
    "image": "https://media.deseretdigital.com/file/8c828b3945",
    "bio": "Lincoln P. Martins, 38, Campinas, Brazil; CEO, Sforza Grupo; currently serving as president of the Campinas Brazil Castelo Stake; former bishop; wife, Bianca Marcelina; six children."
}, {
    "image": "https://media.deseretdigital.com/file/bf1a373767",
    "bio": "Clement M. Matswagothata, 38, Gaborone, Botswana; general manager, Barloworld Motor; currently serving as president of the Gaborone Botswana Stake; former bishop and bishopric member; wife, Busisiwe Novelty; three children."
}, {
    "image": "https://media.deseretdigital.com/file/e3be9d6181",
    "bio": "Carl R. Maurer, 58, Moorooka, Australia; self-reliance services manager, Australia Adelaide/Brisbane/Perth Self-Reliance Services Region; recently released as president of the Australia Perth Mission; former bishop, high councilor, mission president, stake mission president and stake president; wife, Karen; six children."
}, {
    "image": "https://media.deseretdigital.com/file/66a6497567",
    "bio": "Daniel S. Mehr II, 63, Highland, Utah; retired; currently serving as president of a Provo MTC district; former bishop, bishopric member, high councilor and mission president; wife, Rebecca; six children."
}, {
    "image": "https://media.deseretdigital.com/file/af65be5597",
    "bio": "Glen D. Mella, 60, Orem, Utah; chief executive officer, Axcend; recently released as president of the California San Jose Mission; former bishop, high councilor and stake presidency member; wife, Elizabeth; eight children."
}, {
    "image": "https://media.deseretdigital.com/file/a0fa181946",
    "bio": "Isaac K. Morrison, 40, Tema, Ghana; area materials management manager, Africa West Area; currently serving as president of the Ashaiman Ghana Stake; former bishop, bishopric member, stake presidency member and stake president; wife, Hannah; three children."
}, {
    "image": "https://media.deseretdigital.com/file/c6f3dd0866",
    "bio": "Yutaka Nagatomo, 65, Miyakonojo, Japan; currently serving in the presidency of the Kagoshima Japan District; former branch president, district president and mission presidency member; wife: Eiko."
}, {
    "image": "https://media.deseretdigital.com/file/c78d426156",
    "bio": "Allistair B. Odgers, 62, Rangiora, New Zealand; counselor, R13 Trust; currently serving as stake institute teacher; former bishop, bishopric member, district president, mission president and stake president; wife, Noeline; four children."
}, {
    "image": "https://media.deseretdigital.com/file/6dc71e2364",
    "bio": "R. Jeffrey Parker, 62, Firle, Australia; currently serving as president of the Australia Adelaide Mission; former bishop, bishopric member, high councilor and stake president; wife, Lisa; four children."
}, {
    "image": "https://media.deseretdigital.com/file/c846d35228",
    "bio": "Victor P. Patrick, 60, Tampa, Florida; retired; currently serving as assistant Public Affairs director; former bishop, bishopric member, mission president and stake president; wife, Elizabeth; eight children."
}, {
    "image": "https://media.deseretdigital.com/file/ff0f8e2366",
    "bio": "Denis E. Pineda, 41, Villa Nueva, Guatemala; sales representative, Importación Imercadeo; currently serving as president of the Linda Vista Guatemala Stake; former bishop, stake presidency member and stake president; wife, Glenda; three children."
}, {
    "image": "https://media.deseretdigital.com/file/f60af31855",
    "bio": "Henrique S. Simplicio, 54, Fortaleza, Brazil; self-reliance services manager, Self-Reliance Services; currently serving as president of the Fortaleza Brazil Stake; former bishop, high councilor, mission president and stake presidency member; wife, Ester; three children."
}, {
    "image": "https://media.deseretdigital.com/file/c3a1642161",
    "bio": "Jeffrey H. Singer, 53, Sharjah, United Arab Emirates; professor, American University of Sharjah; currently serving as president of the Abu Dhabi Stake; former bishop, bishopric member and high councilor; wife, Sandy; seven children."
}, {
    "image": "https://media.deseretdigital.com/file/213dc52149",
    "bio": "Michael L. Staheli, 60, Smithfield, Utah; business owner, TFI Holdings Inc.; currently serving as president of the Smithfield Utah North Stake; former bishop, bishopric member, high councilor and stake presidency member; wife, Linda; seven children."
}, {
    "image": "https://media.deseretdigital.com/file/7e8ff56052",
    "bio": "Djarot Subiantoro, 58, Tangerang, Indonesia; chairman, Indonet; currently serving as president of the Jakarta Indonesia Stake; former branch president, district presidency member and mission presidency member; wife, Julinda; four children."
}, {
    "image": "https://media.deseretdigital.com/file/d674fe9299",
    "bio": "Jeffrey K. Wetzel, 59, Salt Lake City, Utah; president, Wetzel Enterprises; currently serving as president of the Salt Lake Monument Park Stake; former bishop, bishopric member, high councilor, stake mission president and stake president; wife, Molly; four children."
}, {
    "image": "https://media.deseretdigital.com/file/74b0596941",
    "bio": "Michael S. Wilstead, 60, St. George, Utah; consultant, self-employed; currently serving as priests quorum adviser; former branch president, high councilor, mission president and stake presidency member; wife, Denise; four children."
}, {
    "image": "https://media.deseretdigital.com/file/fe95d78816",
    "bio": "Helmut Wondra, 45, Vienna, Austria; manager, Freelance (music events, choir tours); currently serving as president of the Vienna Austria Stake; former bishop and bishopric member; wife, Julia; two children."
}, {
    "image": "https://media.deseretdigital.com/file/f01c445893",
    "bio": "David L. Wright, 56, Central Point, Oregon; vice president/owner, All-Ways Trucking Inc.; currently serving as Sunday School teacher; former bishop, high councilor, mission president, stake mission president and stake president; wife, Cynthia; six children."
}]